# Environment roast
brew "yadm"
brew "elvish"
brew "helix"
cask "ghostty"
brew "zellij"
brew "dockutil"
brew "git-delta"
brew "lazygit"

tap "rsteube/homebrew-tap"
brew "rsteube/tap/carapace"

tap "oven-sh/bun"
brew "bun"

tap "homebrew/cask-fonts"
cask "font-jetbrains-mono"
cask "font-monaspace"

# Nice tools
brew "eza"
brew "bat"
# See http://hasseg.org/blog/post/406/trash-files-from-the-os-x-command-line/ for why trash is superior
brew "trash"
brew "httpie"
cask "iina"
cask "secretive"
cask "keyboard-cleaner"

# Kubernetes-related
brew "kubectl"
brew "helm"
brew "helm-ls"
brew "k9s"

# Programming tools
brew "git"
brew "php"
brew "composer"
brew "httpie"
brew "go"
brew "jq"
brew "yq"
brew "mongosh"
cask "visual-studio-code"
cask "mailpit"

cask "orbstack"
cask "hiddenbar"
cask "maccy"
cask "firefox"

mas "AdGuard for Safari", id: 1440147259
mas "JSON Peep for Safari", id: 1458969831
