# Environment roast
brew "yadm"
brew "helix"
cask "ghostty"
brew "dockutil"
brew "git-delta"
brew "lazygit"
brew "navi"
brew "zsh"
brew "zsh-syntax-highlighting"

tap "rsteube/homebrew-tap"
brew "rsteube/tap/carapace"

tap "oven-sh/bun"
brew "oven-sh/bun/bun"

cask "font-jetbrains-mono"
cask "font-monaspace"

# Nice tools
brew "eza"
brew "dust"
brew "bat"
brew "glow"
# See http://hasseg.org/blog/post/406/trash-files-from-the-os-x-command-line/ for why trash is superior
brew "trash"
brew "mas"
brew "hyperfine"
cask "iina"
cask "keyboard-cleaner"
cask "appcleaner"

# AI tools
cask "codex"

# Kubernetes-related
brew "kubectl"
brew "helm"
brew "helm-ls"
brew "k9s"
brew "teleport"
brew "dive"
brew "kind"

# Programming tools
brew "git"
brew "php"
brew "composer"
brew "httpie"
brew "go"
brew "delve"
brew "jq"
brew "yq"
brew "mongosh"
brew "mailpit"
brew "vexctl"
brew "gh"
brew "jwt-cli"
brew "pwgen"
cask "zed"
cask "cyberduck"
cask "bruno"
cask "utm"

# Work
tap "tink-crypto/tink-tinkey"
brew "tinkey"
cask "linear-linear"

# Fun stuff
brew "lolcat"
brew "cowsay"
brew "fortune"

tap "aquasecurity/trivy"
brew "aquasecurity/trivy/trivy"

cask "orbstack"
cask "hiddenbar"
cask "maccy"
cask "google-chrome"
cask "chatgpt-atlas"
cask "chatgpt"
cask "tableplus"

mas "AdGuard for Safari", id: 1440147259
mas "JSON Peep for Safari", id: 1458969831
mas "Collections", id: 1568395334
mas "Infuse", id: 1136220934
mas "Windows App", id: 1295203466
