# Utilies
brew "antigen"

# Development
brew "php"
brew "php@7.4"
brew "composer"

# Fun stuff
brew "cmatrix"
brew "cowsay"
brew "lolcat"
brew "fortune"

# Other tools
brew "asciinema"

# Casks
cask "zoom"
cask "google-chrome"
cask "messenger"
cask "appcleaner"
cask "cakebrew"
cask "cakebrew"
cask "microsoft-remote-desktop"
cask "tunnelblick"
cask "telegram"
cask "setapp"
cask "teamviewer"
cask "vlc"
cask "wireshark"
cask "omnidisksweeper"
cask "macs-fan-control"
cask "discord"
cask "sdformatter"
cask "unetbootin"
cask "vlc"
cask "1password"
cask "jetbrains-toolbox"

# MAS-only apps
# - Garageband
# - Notes exporter
# - Spark Mail
# - JSON Peep
