brew "elvish"
brew "k9s"
brew "starship"
brew "eza"

brew "kubectl"
brew "kubectx"
brew "helm"

brew "php@8.2"
brew "composer"
brew "httpie"
brew "go@1.21"
brew "jq"
brew "bat"
brew "mongosh"
brew "shellcheck"
brew "z"
brew "gitui"
tap "oven-sh/bun"
brew "bun"
brew "openjdk@11"
brew "sbt"
brew "k6"

cask "hyper"
cask "orbstack"
cask "warp"
cask "mongodb-compass"
cask "secretive"
cask "hiddenbar"
cask "microsoft-remote-desktop"
cask "iina"
cask "google-chrome"
cask "google-cloud-sdk"
cask "readdle-spark"
cask "maccy"
cask "tableplus"
cask "1password"
cask "drawio"
cask "powershell"
cask "fly"
cask "httpie"
cask "rapidapi"
cask "postman"
cask "firefox"

cask "phpstorm"
cask "intellij-idea"
cask "goland"

tap "rsteube/homebrew-tap"
brew "rsteube/tap/carapace"

tap "homebrew/cask-fonts"
cask "font-jetbrains-mono"

tap "mongodb/brew"
brew "mongodb-database-tools"

tap "hashicorp/tap"
brew "hashicorp/tap/terraform"

mas "AdGuard for Safari", id: 1440147259
mas "Passepartout", id: 1433648537
mas "JSON Peep for Safari", id: 1458969831
